{
   "paper1": {
    "authors": [
      "Yan Vianna Sym",
      "João Gabriel Moura Campos",
      "Fabio Cozman"
      ],
    "title": "BLAB Reporter: Automated journalism covering the Blue Amazon",
    "session": "",
    "abstract": "This demo paper introduces BLAB reporter, a robot-journalist system covering the Brazilian Blue Amazon. The application is based on a pipeline architecture for Natural Language Generation, which offers daily reports, news summaries and curious facts in Brazilian Portuguese. By collecting, storing and analysing structured data from publicly available sources, the robot-journalist uses domain knowledge to generate, validate and publish texts in Twitter. Code and corpus are publicly available.",
    "UID": "paper1",
    "start_time": "",
    "paper": "https://openreview.net/attachment?id=gw2rJYVnHeX&name=paper",
    "summary_video": "https://openreview.net/attachment?id=gw2rJYVnHeX&name=video_preview",
    "summary_video_captions": "",
    "full_video": "",
    "full_video_captions": "",
    "PDF": "https://openreview.net/attachment?id=lsaIVpSiGKE&name=slides"
  },
  "paper2": {
    "authors": [
      "Andres Garcia-Silva",
      "Cristian Berrio",
      "Jose Manuel Gomez-Perez",
      "Jose Antonio Martinez-Heras",
      "Patrick Fleith",
      "Stefano Scaglioni"
      ],
    "title": "Generating Quizzes to Support Training on Quality Management and Assurance in Space Science and Engineering",
    "session": "",
    "abstract": "Quality management and assurance is key for space agencies to guarantee the success of space missions, which are high-risk and extremely costly. In this paper, we present a system to generate quizzes, a common resource to evaluate the effectiveness of training sessions, from documents about quality assurance procedures in the Space domain. Our system leverages state of the art auto-regressive models like T5 and BART to generate questions, and a RoBERTa model to extract answers for such questions, thus verifying their suitability.",
    "UID": "paper2",
    "start_time": "",
    "paper": "https://openreview.net/pdf?id=lsaIVpSiGKE",
    "summary_video": "https://openreview.net/attachment?id=lsaIVpSiGKE&name=video_preview",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=lsaIVpSiGKE&name=presentation_video",
    "full_video_captions": "",
    "PDF": "https://openreview.net/attachment?id=lsaIVpSiGKE&name=slides"
  },
  "paper3": {
    "authors": [
      "Vishakha Kadam",
      "Yiping Jin",
      "Bao-Dai Nguyen-Hoang"
      ],
    "title": "Automated Ad Creative Generation",
    "session": "",
    "abstract": "Ad creatives are ads served to users on a webpage, app, or other digital environments. The demand for compelling ad creatives surges drastically with the ever-increasing popularity of digital marketing. The two most essential elements of (display) ad creatives are the advertising message, such as headlines and description texts, and the visual component, such as images and videos. Traditionally, ad creatives are composed by professional copywriters and creative designers. The process requires significant human effort, limiting the scalability and efficiency of digital ad campaigns. This work introduces AUTOCREATIVE, a novel system to automatically generate ad creatives relying on natural language generation and computer vision techniques. The system generates multiple ad copies (ad headlines/description texts) using a sequence-to-sequence model and selects images most suitable to the generated ad copies based on heuristic-based visual appeal metrics and a text-image retrieval pipeline.",
    "UID": "paper3",
    "start_time": "",
    "paper": "https://openreview.net/pdf?id=Xv5Y2Jl0mbA",
    "summary_video": "https://openreview.net/attachment?id=Xv5Y2Jl0mbA&name=video_preview",
    "summary_video_captions": "https://openreview.net/attachment?id=Xv5Y2Jl0mbA&name=video_preview_captions",
    "full_video": "https://openreview.net/attachment?id=Xv5Y2Jl0mbA&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=Xv5Y2Jl0mbA&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=Xv5Y2Jl0mbA&name=slides"
  },
  "paper4": {
    "authors": [
      "Rudolf Rosa",
      "Patrícia Schmidtová",
      "Alisa Zakhtarenko",
      "Ondrej Dusek",
      "Tomáš Musil",
      "David Mareček",
      "Saad Obaid Ul Islam",
      "Marie Nováková",
      "Klára Vosecká",
      "Daniel Hrbek",
      "David Košťák"
      ],
    "title": "THEaiTRobot: An Interactive Tool for Generating Theatre Play Scripts",
    "session": "",
    "abstract": "We present a free online demo of THEaiTRobot, an open-source bilingual tool for interactively generating theatre play scripts, in two versions. THEaiTRobot 1.0 uses the GPT-2 language model with minimal adjustments. THEaiTRobot 2.0 uses two models created by fine-tuning GPT-2 on purposefully collected and processed datasets and several other components, generating play scripts in a hierarchical fashion (title $\rightarrow$ synopsis $\rightarrow$ script). The underlying tool is used in the THEaiTRE project to generate scripts for plays, which are then performed on stage by a professional theatre.",
    "UID": "paper4",
    "start_time": "",
    "paper": "https://openreview.net/attachment?id=T7gJwMym9Fg&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=T7gJwMym9Fg&name=presentation_video"
,    "full_video_captions": "",
    "PDF": "https://openreview.net/attachment?id=T7gJwMym9Fg&name=slides"
  },
  "paper5": {
    "authors": [
      "Zhao Han",
      "Polina Rygina",
      "Thomas Williams"
      ],
    "title": "Evaluating Cognitive Status Informed Referring Form Selection Models Under Contexts of Ambiguity and Ignorance",
    "session": "Oral Session 4",
    "abstract": "For autonomous agents such as robots to effectively communicate with humans, they must be able to refer to different entities in situated contexts. In service of this goal, researchers have recently attempted to model the selection of referring forms on the basis of cognitive status (informed by Givenness Hierarchy), and have shown promising results with over 80% accuracy. However, we argue that the task environments lack ecological validity, due to their use of a small number of objects that are constantly activated and easily uniquely identifiable. Accordingly, we present a novel buildingconstruction task that we believe has increased ecological validity. We then show how training cognitive status informed referring form selection models on data collected within this novel task environment yields substantially different results from those found in previous work, providing key insights and directions for future work.",
    "UID": "paper5",
    "start_time": "2022-07-21T16:00:00Z",
    "paper": "https://openreview.net/forum?id=r_du-JsTqJ5",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=ZPZAXsXMLeVs&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=ZPZAXsXMLeVs&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=ZPZAXsXMLeVs&name=poster"
  },
  "paper6": {
    "authors": [
      "Dmitry Lamanov",
      "Pavel Burnyshev",
      "Valentin Malykh",
      "Andrey Bout",
      "Irina Piontkovskaya"
      ],
    "title": "Template-based Approach to Zero-shot Intent Recognition",
    "session": "Oral Session 1",
    "abstract": "The recent advances in transfer learning techniques and pre-training of large contextualized encoders foster innovation in real-life applications, including dialog assistants. Practical needs of intent recognition require effective data usage and the ability to constantly update supported intents, adopting new ones, and abandoning outdated ones. In particular, the generalized zero-shot paradigm, in which the model is trained on the seen intents and tested on both seen and unseen intents, is taking on new importance. In this paper, we explore the generalized zero-shot setup for intent recognition. Following best practices for zero-shot text classification, we treat the task with a sentence pair modeling approach. We outperform previous state-of-the-art f1-measure by up to 16% for unseen intents, using intent labels and user utterances and without accessing external sources (such as knowledge bases). Further enhancement includes lexicalization of intent labels, which improves performance by up to 7%. By using task transferring from other sentence pair tasks, such as Natural Language Inference, we gain additional improvements.",
    "UID": "paper6",
    "start_time": "2022-07-19T14:20:00Z",
    "paper": "https://openreview.net/forum?id=k1EBwhNaNFU",
    "summary_video": "",
    "summary_video_captions": "https://openreview.net/attachment?id=kYl6QZO2cFm5&name=video_preview_captions",
    "full_video": "https://openreview.net/attachment?id=kYl6QZO2cFm5&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=kYl6QZO2cFm5&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=kYl6QZO2cFm5&name=slides"
  },
  "paper7": {
    "authors": [
      "Wanzheng Zhu",
      "Suma Bhat"
      ],
    "title": "'Slow Service' $\\cancel{\\rightarrow}$ 'Great Food': Enhancing Content Preservation in Unsupervised Text Style Transfer",
    "session": "Oral Session 3",
    "abstract": "Text style transfer aims to change the style (e.g., sentiment, politeness) of a sentence while preserving its content. A common solution is the prototype editing approach, where stylistic tokens are deleted in the “mask” stage and then the masked sentences are infilled with the target style tokens in the “infill” stage. Despite their success, these approaches still suffer from the content preservation problem. By closely inspecting the results of existing approaches, we identify two common types of errors: 1) many content-related tokens are masked and 2) irrelevant words associated with the target style are infilled. Our paper aims to enhance content preservation by tackling each of them. In the “mask” stage, we utilize a BERT-based keyword extraction model that incorporates syntactic information to prevent content-related tokens from being masked. In the “infill” stage, we create a pseudo-parallel dataset and train a T5 model to infill the masked sentences without introducing irrelevant content. Empirical results show that our method outperforms the state-of-theart baselines in terms of content preservation, while maintaining comparable transfer effectiveness and language quality.",
    "UID": "paper7",
    "start_time": "2022-07-21T15:00:00Z",
    "paper": "/forum?id=Hx-gj_gbgGq&referrer=%5BAuthor%20Console%5D(%2Fgroup%3Fid%3Daclweb.org%2FACL%2FARR%2F2022%2FMarch%2FAuthors%23your-submissions)",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=9XWJRLhbK6&name=presentation_video"
,    "full_video_captions": "",
    "PDF": "https://openreview.net/attachment?id=9XWJRLhbK6&name=slides"
  },
  "paper8": {
    "authors": [
      "Jonathan Emami",
      "Pierre Nugues",
      "Ashraf Elnagar",
      "Imad Afyouni"
      ],
    "title": "Arabic Image Captioning using Pre-training of Deep Bidirectional Transformers",
    "session": "Poster Session 1",
    "abstract": "Image captioning is the process of automatically generating a textual description of an image. It has a wide range of applications, such as effective image search, auto archiving and even helping visually impaired people to see. English image captioning has seen a lot of development lately, while Arabic image captioning is lagging behind. In this work, we developed and evaluated several Arabic image captioning models with well-established metrics on a public image captioning benchmark. We initialized all models with transformers pre-trained on different Arabic corpora. After initialization, we fine-tuned them with image-caption pairs using a learning method called OSCAR. OSCAR uses object tags detected in images as anchor points to significantly ease the learning of image-text semantic alignments. In relation to the image captioning benchmark, our best performing model scored 0.39, 0.25, 0.15 and 0.092 with BLEU-1,2,3,4 respectively1 , an improvement over previously published scores of 0.33, 0.19, 0.11 and 0.057. Beside additional evaluation metrics, we complemented our scores with human evaluation on a sample of our output. Our experiments showed that training image captioning models with Arabic captions and English object tags is a working approach, but that a pure Arabic dataset, with Arabic object tags, would be preferable.",
    "UID": "paper8",
    "start_time": "2022-07-19T16:20:00Z",
    "paper": "https://openreview.net/pdf?id=reb82_ebeM9",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=MNEQkVei2UX&name=presentation_video"
,    "full_video_captions": "",
    "PDF": "https://openreview.net/attachment?id=MNEQkVei2UX&name=poster"
  },
  "paper9": {
    "authors": [
      "Yiping Jin",
      "Vishakha Kadam",
      "Dittaya Wanvarie"
      ],
    "title": "Plot Writing From Pre-Trained Language Models",
    "session": "Oral Session 2",
    "abstract": "Pre-trained language models (PLMs) fail to generate long-form narrative text because they do not consider global structure. As a result, the generated texts are often incohesive, repetitive, or lack content. Recent work in story generation reintroduced explicit content planning in the form of prompts, keywords, or semantic frames. Trained on large parallel corpora, these models can generate more logical event sequences and thus more contentful stories. However, these intermediate representations are often not in natural language and cannot be utilized by PLMs without fine-tuning. We propose generating story plots using offthe-shelf PLMs while maintaining the benefit of content planning to generate cohesive and contentful stories. Our proposed method, SCRATCHPLOT, first prompts a PLM to compose a content plan. Then, we generate the story’s body and ending conditioned on the content plan. Furthermore, we take a generateand-rank approach by using additional PLMs to rank the generated (story, ending) pairs. We benchmark our method with various baselines and achieved superior results in both human and automatic evaluation.",
    "UID": "paper9",
    "start_time": "2022-07-20T11:10:00Z",
    "paper": "https://openreview.net/attachment?id=OmaJ3Uv1tTxK&name=paper",
    "summary_video": "https://openreview.net/attachment?id=OmaJ3Uv1tTxK&name=video_preview",
    "summary_video_captions": "https://openreview.net/attachment?id=OmaJ3Uv1tTxK&name=video_preview_captions",
    "full_video": "https://openreview.net/attachment?id=OmaJ3Uv1tTxK&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=OmaJ3Uv1tTxK&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=OmaJ3Uv1tTxK&name=slides"
  },
  "paper10": {
    "authors": [
      "Joosung Lee"
      ],
    "title": "Paraphrasing via Ranking Many Candidates",
    "session": "Poster Session 2",
    "abstract": "We present a simple and effective way to generate a variety of paraphrases and find a good quality paraphrase among them. As in previous studies, it is difficult to ensure that one generation method always generates the best paraphrase in various domains. Therefore, we focus on finding the best candidate from multiple candidates, rather than assuming that there is only one combination of generative models and decoding options. Our approach shows that it is easy to apply in various domains and has sufficiently good performance compared to previous methods. In addition, our approach can be used for data augmentation that extends the downstream corpus, showing that it can help improve performance in English and Korean datasets.",
    "UID": "paper10",
    "start_time": "2022-07-20T14:50:00Z",
    "paper": "https://openreview.net/attachment?id=AazNy3HOJFou&name=paper",
    "summary_video": "https://openreview.net/attachment?id=AazNy3HOJFou&name=video_preview",
    "summary_video_captions": "https://openreview.net/attachment?id=AazNy3HOJFou&name=video_preview_captions",
    "full_video": "https://openreview.net/attachment?id=AazNy3HOJFou&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=AazNy3HOJFou&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=AazNy3HOJFou&name=poster"
  },
  "paper11": {
    "authors": [
      "Nicolas Garneau",
      "Eve Gaumond",
      "Luc Lamontagne",
      "Pierre-Luc Déziel"
      ],
    "title": "Evaluating Legal Accuracy of Neural Generators on the Generation of Criminal Court Dockets Description",
    "session": "Oral Session 2",
    "abstract": "Docket files, also known as plumitifs, are legal text documents describing judicial cases. They are present in most jurisdictions and are meant to provide a window on legal systems. They contain information of a judicial case such as parties’ identities, accusations’ provisions, decisions, and pleas. However, this information is cryptic, using abbreviations, and making references to the criminal code. In this paper, we explore the use of neural text generators to improve the legal accuracy of the docket file verbalization regarding the accusations, decisions, and pleas sections. We introduce a legal accuracy evaluation scale used by jurists to manually assess the performance of three architectures with different levels of prior knowledge injection. We also study the correlation of our human evaluation methodology with automatic metrics.",
    "UID": "paper11",
    "start_time": "2022-07-20T10:30:00Z",
    "paper": "https://openreview.net/attachment?id=UHY8uBA6l_&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=UHY8uBA6l_&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=UHY8uBA6l_&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=UHY8uBA6l_&name=slides"
  },
  "paper12": {
    "authors": [
      "Maximilain Koppatz",
      "Khalid Alnajjar",
      "Mika Hämäläinen",
      "Thierry Poibeau"
      ],
    "title": "Automatic Generation of Factual News Headlines in Finnish",
    "session": "Poster Session 2",
    "abstract": "We present a novel approach to generating news headlines in Finnish for a given news story. We model this as a summarization task where a model is given a news article, and its task is to produce a concise headline describing the main topic of the article. Because there are no openly available GPT-2 models for Finnish, we will first build such a model using several corpora. The model is then fine-tuned for the headline generation task using a massive news corpus. The system is evaluated by 3 expert journalists working in a Finnish media house. The results showcase the usability of the presented approach as a headline suggestion tool to facilitate the news production process.",
    "UID": "paper12",
    "start_time": "2022-07-20T14:50:00Z",
    "paper": "https://openreview.net/attachment?id=_OU1ijTPbj5&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=_OU1ijTPbj5&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=_OU1ijTPbj5&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=_OU1ijTPbj5&name=slides"
  },
  "paper13": {
    "authors": [
      "Nazia Attari",
      "David Schlangen",
      "Martin Heckmann",
      "Heiko Wersing",
      "Sina Sina Zarrieß"
      ],
    "title": "Generating Coherent and Informative Descriptions for Groups of Visual Objects and Categories: A Simple Decoding Approach",
    "session": "Oral Session 4",
    "abstract": "State-of-the-art image captioning models achieve very good performance in generating descriptions for instances of visual categories and reasoning about them, e.g. imposing distinctiveness of the description in the context of distractors. In this work, we propose an inference mechanism that extends an instancelevel captioning model to generate coherent and informative descriptions for groups of visual objects from the same or different categories. We test our model in the domain of bird descriptions. We show that group-level descriptions generated by our method are (i) coherent, pulling together properties that are true for all or majority of its instances, and (ii) informative, as they allow an external BERT-based text classifier to identify the target category more accurately in comparison to single-instance captions and are preferred by human evaluators.",
    "UID": "paper13",
    "start_time": "2022-07-21T16:40:00Z",
    "paper": "https://openreview.net/attachment?id=eQ9x1x11wMl&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=eQ9x1x11wMl&name=presentation_video"
,    "full_video_captions": "",
    "PDF": "https://openreview.net/attachment?id=eQ9x1x11wMl&name=slides"
  },
  "paper14": {
    "authors": [
      "Javier González Corbelle",
      "Alberto Bugarín-Diz",
      "Jose Maria Alonso-Moral",
      "Juan Taboada"
      ],
    "title": "Dealing with hallucination and omission in neural Natural Language Generation: A use case on meteorology.",
    "session": "Oral Session 2",
    "abstract": "Hallucinations and omissions need to be carefully handled when using neural models for performing Natural Language Generation tasks. In the particular case of data to text applications, neural models are usually trained on large-scale datasets and sometimes generate text including divergences with respect to the input data. In this paper, we show the impact of the lack of domain knowledge in the generation of texts containing input-output divergences through a use case on meteorology. To analyze these phenomena we adapt a Transformer-based model to our specific domain, i.e., meteorology, and train it with a new dataset and corpus curated by meteorologists. Then, we perform a divergences’ detection step with a simple detector in order to identify the clearest divergences, especially those involving hallucinations. Finally, these hallucinations are analyzed by an expert in the meteorology domain, with the aim of classifying them by severity, taking into account the domain knowledge.",
    "UID": "paper14",
    "start_time": "2022-07-20T10:50:00Z",
    "paper": "https://openreview.net/attachment?id=4jfgTOYIf2Eo&name=paper",
    "summary_video": "https://openreview.net/attachment?id=4jfgTOYIf2Eo&name=video_preview",
    "summary_video_captions": "https://openreview.net/attachment?id=4jfgTOYIf2Eo&name=video_preview_captions",
    "full_video": "https://openreview.net/attachment?id=4jfgTOYIf2Eo&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=4jfgTOYIf2Eo&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=4jfgTOYIf2Eo&name=slides"
  },
  "paper15": {
    "authors": [
      "Richard Yuanzhe Pang",
      "He He",
      "Kyunghyun Cho"
      ],
    "title": "Amortized Noisy Channel Neural Machine Translation",
    "session": "Poster Session 2",
    "abstract": "Noisy channel models have been especially effective in neural machine translation (NMT). However, recent approaches like “beam search and rerank” (BSR) incur significant computation overhead during inference, making realworld application infeasible. We aim to study if it is possible to build an amortized noisy channel NMT model such that when we do greedy decoding during inference, the translation accuracy matches that of BSR in terms of reward (based on the source-to-target log probability and the target-to-source log probability) and quality (based on BLEU and BLEURT). We attempt three approaches to train the new model: knowledge distillation, 1- step-deviation imitation learning, and Q learning. The first approach obtains the noisy channel signal from a pseudo-corpus, and the latter two approaches aim to optimize toward a noisy-channel MT reward directly. For all three approaches, the generated translations fail to achieve rewards comparable to BSR, but the translation quality approximated by BLEU and BLEURT is similar to the quality of BSRproduced translations. Additionally, all three approaches speed up inference by 1–2 orders of magnitude.",
    "UID": "paper15",
    "start_time": "2022-07-20T14:50:00Z",
    "paper": "https://openreview.net/attachment?id=uqa37QTWa9jD&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=uqa37QTWa9jD&name=presentation_video"
,    "full_video_captions": "",
    "PDF": "https://openreview.net/attachment?id=uqa37QTWa9jD&name=poster"
  },
  "paper16": {
    "authors": [
      "Kashyapa Niyarepola",
      "Dineth Athapaththu",
      "Savindu Kalsara Ekanayake",
      "Surangika Ranathunga"
      ],
    "title": "Math Word Problem Generation with Multilingual Language Models",
    "session": "Poster Session 2",
    "abstract": "Auto regressive text generation for lowresource languages, particularly the option of using pre-trained language models, is a relatively under-explored problem. In this paper, we model Math Word Problem (MWP) generation as an auto-regressive text generation problem. We evaluate the pre-trained sequence-tosequence language models (mBART and mT5) in the context of two low-resource languages, Sinhala and Tamil, as well as English. For the evaluation, we create a multi-way parallel MWP dataset for the considered languages. Our empirical evaluation analyses how the performance of the pre-trained models is affected by the (1) amount of language data used during pre-training, (2) amount of data used in finetuning, (3) input seed length and (4) context differences in MWPs. Our results reveal that the considered pre-trained models are capable of generating meaningful MWPs even for the languages under-represented in these models, even though the amount of fine-tuning data and seed length are small. Our human evaluation shows that a Mathematics tutor can edit a generation question fairly easily, thus highlighting the practical utility ofautomatically generating MWPs.",
    "UID": "paper16",
    "start_time": "2022-07-20T14:50:00Z",
    "paper": "https://openreview.net/attachment?id=Hk2MuvZkPw&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=Hk2MuvZkPw&name=presentation_video"
,    "full_video_captions": "",
    "PDF": "https://openreview.net/attachment?id=Hk2MuvZkPw&name=poster"
  },
  "paper17": {
    "authors": [
      "Simone Balloccu",
      "Ehud Reiter"
      ],
    "title": "Comparing informativeness of an NLG chatbot vs graphical app in diet-information domain",
    "session": "Oral Session 1",
    "abstract": "Visual representation of data like charts and tables can be challenging to understand for readers. Previous work showed that combining visualisations with text can improve the communication of insights in static contexts, but little is known about interactive ones. In this work we present an NLG chatbot that processes natural language queries and provides insights through a combination of charts and text. We apply it to nutrition, a domain communication quality is critical. Through crowd-sourced evaluation we compare the informativeness of our chatbot against traditional, static diet-apps. We find that the conversational context significantly improved users understanding of dietary data in various tasks, and that users considered the chatbot as more useful and quick to use than traditional apps.",
    "UID": "paper17",
    "start_time": "2022-07-19T14:00:00Z",
    "paper": "https://openreview.net/attachment?id=5tgwpr8QlwQ&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=5tgwpr8QlwQ&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=5tgwpr8QlwQ&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=5tgwpr8QlwQ&name=slides"
  },
  "paper18": {
    "authors": [
      "Kevin Ros",
      "Maxwell Jong",
      "Chak Ho Chan",
      "ChengXiang Zhai"
      ],
    "title": "Generation of Student Questions for Inquiry-based Learning",
    "session": "Poster Session 1",
    "abstract": "Asking questions during a lecture is a central part of the traditional classroom setting which benefits both students and instructors in many ways. However, no previous work has studied the task of automatically generating student questions based on explicit lecture context. We study the feasibility of automatically generating student questions given the lecture transcript windows where the questions were asked. First, we create a data set of student questions and their corresponding lecture transcript windows. Using this data set, we investigate variants of T5, a sequence-to-sequence generative language model, for a preliminary exploration of this task. Specifically, we compare the effects of training with continuous prefix tuning and pre-training with search engine queries. Question generation evaluation results on two MOOCs show that that pre-training on search engine queries tends to make the generation model more precise whereas continuous prefix tuning offers mixed results.",
    "UID": "paper18",
    "start_time": "2022-07-19T16:20:00Z",
    "paper": "",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=RfcIn_NEAJT&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=RfcIn_NEAJT&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=RfcIn_NEAJT&name=poster"
  },
  "paper19": {
    "authors": [
      "Ying-Hong Chan",
      "Ho-Lam Chung",
      "Yao-Chung Fan"
      ],
    "title": "Keyword Provision Question Generation for Facilitating Educational Reading Comprehension Preparation",
    "session": "Poster Session 1",
    "abstract": "Question Generation (QG) receives increasing research attention in the NLP community. One QG motivation is to facilitate the preparation of educational reading practice and assessments. While significant advancement of QG techniques was reported, we find current QG techniques are short in terms of controllability and question difficulty for educational applications. This paper reports our studies toward the two issues. First, we report a state-of-the-art examlike QG model by advancing the current best model from 11.96 to 20.19 (in terms of BLEU 4 score). Second, we propose a QG model that allows users to provide keywords for gUIDing QG direction. Human evaluation and case studies are conducted to demonstrate the feasibility of controlling question generation direction.",
    "UID": "paper19",
    "start_time": "2022-07-19T16:20:00Z",
    "paper": "https://openreview.net/attachment?id=znPsX-_W8Po&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=znPsX-_W8Po&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=znPsX-_W8Po&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=znPsX-_W8Po&name=slides"
  },
  "paper20": {
    "authors": [
      "Sina Zarrieß",
      "Henrik Voigt",
      "David Schlangen",
      "Philipp Sadler"
      ],
    "title": "Generating Landmark-based Manipulation Instructions from Image Pairs",
    "session": "Oral Session 4",
    "abstract": "We investigate the problem of generating landmark-based manipulation instructions (e.g. move the blue block so that it touches the red block on the right) from image pairs showing a before and an after state in a visual scene. We present a transformer model with difference attention heads that learns to attend to target and landmark objects in consecutive images via a difference key. Our model outperforms the state-of-the-art for instruction generation on the BLOCKS dataset and particularly improves the accuracy of generated target and landmark references. Furthermore, our model outperforms state-of-the-art models on a difference spotting dataset.",
    "UID": "paper20",
    "start_time": "2022-07-21T17:00:00Z",
    "paper": "https://openreview.net/attachment?id=OgdQCfHMNrr&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=OgdQCfHMNrr&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=OgdQCfHMNrr&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=OgdQCfHMNrr&name=slides"
  },
  "paper21": {
    "authors": [
      "Malihe Alikhani",
      "Thomas H Kober",
      "Bashar Alhafni",
      "Yue Chen",
      "Mert Inan",
      "Elizabeth Kaye Nielsen",
      "Shahab Raji",
      "Mark Steedman",
      "Matthew Stone"
      ],
    "title": "Zero-shot Cross-Linguistic Learning of Event Semantics",
    "session": "Oral Session 3",
    "abstract": "Typologically diverse languages offer systems of lexical and grammatical aspect that allow speakers to focus on facets of event structure in ways that comport with the specific communicative setting and discourse constraints they face. In this paper, we look specifically at captions of images across Arabic, Chinese, Farsi, German, Russian, and Turkish and describe a computational model for predicting lexical aspects. Despite the heterogeneity of these languages, and the salient invocation of distinctive linguistic resources across their caption corpora, speakers of these languages show surprising similarities in the ways they frame image content. We leverage this observation for zero-shot cross-lingual learning and show that lexical aspects can be predicted for a given language despite not having observed any annotated data for this language at all.",
    "UID": "paper21",
    "start_time": "2022-07-21T14:00:00Z",
    "paper": "https://openreview.net/attachment?id=Z3IMYmn7OOM&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "",
    "full_video_captions": "",
    "PDF": ""
  },
  "paper22": {
    "authors": [
      "Yucheng Li",
      "Chenghua Lin",
      "Frank Guerin"
      ],
    "title": "Nominal Metaphor Generation with Multitask Learning",
    "session": "Oral Session 4",
    "abstract": "Nominal metaphors are frequently used in human language and have been shown to be effective in persuading, expressing emotion, and stimulating interest. This paper tackles the problem of Chinese Nominal Metaphor (NM) generation. We introduce a novel multitask framework, which jointly optimizes three tasks: NM identification, NM component identification, and NM generation. The metaphor identification module is able to perform a self-training procedure, which discovers novel metaphors from a large-scale unlabeled corpus for NM generation. The NM component identification module emphasizes components during training and conditions the generation on these NM components for more coherent results. To train the NM identification and component identification modules, we construct an annotated corpus consisting of 6.3k sentences that contain diverse metaphorical patterns. Automatic metrics show that our method can produce diverse metaphors with good readability, where 92% of them are novel metaphorical comparisons. Human evaluation shows our model significantly outperforms baselines on consistency and creativity.",
    "UID": "paper22",
    "start_time": "2022-07-21T16:20:00Z",
    "paper": "https://openreview.net/attachment?id=3CD13Y0-uQh&name=paper",
    "summary_video": "https://openreview.net/attachment?id=3CD13Y0-uQh&name=video_preview",
    "summary_video_captions": "https://openreview.net/attachment?id=3CD13Y0-uQh&name=video_preview_captions",
    "full_video": "https://openreview.net/attachment?id=3CD13Y0-uQh&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=3CD13Y0-uQh&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=3CD13Y0-uQh&name=slides"
  },
  "paper23": {
    "authors": [
      "Nikolai Ilinykh",
      "Yasmeen Emampoor",
      "Simon Dobnik"
      ],
    "title": "Language is Strong, Vision is Not: A Diagnostic Study of the Limitations of the Embodied Question Answering Task",
    "session": "Poster Session 1",
    "abstract": "We focus on the Embodied Question Answering (EQA) task, the dataset and the models (Das et al., 2018). In particular, we examine the effects of vision perturbation at different levels by providing the model with either incongruent, black or random noise images. We observe that the model is still able to learn from general visual patterns, suggesting that they capture some common sense reasoning about the visual world. We argue that a better set of data and models are required to achieve better performance in predicting (generating) correct answers. The code is available here: https://github.com/ GU-CLASP/embodied-qa.",
    "UID": "paper23",
    "start_time": "2022-07-19T16:20:00Z",
    "paper": "https://openreview.net/attachment?id=TlxXK9q4OoE&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=TlxXK9q4OoE&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=TlxXK9q4OoE&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=TlxXK9q4OoE&name=poster"
  },
  "paper24": {
    "authors": [
      "Philipp Heinisch",
      "Anette Frank",
      "Juri Opitz",
      "Philipp Cimiano"
      ],
    "title": "Strategies for framing argumentative conclusion generation",
    "session": "Poster Session 2",
    "abstract": "Generating an argumentative conclusion from a set of textual premises is a challenging task, due to a large range of possible conclusions. In order to provide a conclusion generation model with gUIDance towards generating conclusions from a certain perspective, we explore the impact of conditioning the model on information about the desired framing. We experiment with conditioning generation via generic frame classes as well as with so-called issue-specific frames. Beyond conditioning the model on a desired frame, we investigate the impact of strategies to further improve the generated conclusion by i) an informative label smoothing method that dynamically smooths one-hot-encoded reference conclusion vectors as a regularization mechanism, and ii) a conclusion reranking strategy based on referenceless scores at inference time. We evaluate the benefits of our methods using metrics for automatic evaluation complemented with an extensive manual study. Our results show that frame-gUIDed conclusion generation is beneficial: it increases the ratio of valid and novel conclusions by 23%-points compared to a baseline without frame information. Our work indicates that i) by injecting frame information, conclusion generation can be directed towards desired aspects and ii) at the same time it can be manually confirmed to yield more valid and novel conclusions.",
    "UID": "paper24",
    "start_time": "2022-07-20T14:50:00Z",
    "paper": "https://openreview.net/attachment?id=DE0XE2urXG0&name=paper",
    "summary_video": "https://openreview.net/attachment?id=DE0XE2urXG0&name=video_preview",
    "summary_video_captions": "https://openreview.net/attachment?id=DE0XE2urXG0&name=video_preview_captions",
    "full_video": "https://openreview.net/attachment?id=DE0XE2urXG0&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=DE0XE2urXG0&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=DE0XE2urXG0&name=poster"
  },
  "paper25": {
    "authors": [
      "Xianze Wu",
      "Zaixiang Zheng",
      "Hao Zhou",
      "Yong Yu"
      ],
    "title": "LAFT: Cross-lingual Transfer for Text Generation by Language-Agnostic Finetuning",
    "session": "Oral Session 3",
    "abstract": "Multilingual language pretraining enables possibilities of transferring task knowledge learned from a rich-resource source language to the other, particularly favoring those low-resource languages with few or no task annotated data. However, knowledge about language and tasks encoded is strongly entangled in multilingual neural representations, thereby the learned task knowledge falsely correlated to the source language, falling short of cross-lingual transferability. In this paper, we present a novel language-agnostic finetuning (LAFT) to facilitate zero-resource cross-lingual transfer for text generation. LAFT performs language-agnostic task acquisition to isolate task learning completely from the source language, and then language specification for better generation for specified languages. Experiments demonstrate that the proposed approach facilitates a better and parameter-efficient transferability on two text generation tasks.",
    "UID": "paper25",
    "start_time": "2022-07-21T14:20:00Z",
    "paper": "https://openreview.net/attachment?id=Xxkv1cMHKr9&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=Xxkv1cMHKr9&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=Xxkv1cMHKr9&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=Xxkv1cMHKr9&name=slides"
  },
  "paper26": {
    "authors": [
      "Amin Karamlou",
      "James R Wootton",
      "Marcel Pfaffhauser"
      ],
    "title": "Quantum Natural Language Generation on Near-Term Devices",
    "session": "Oral Session 2",
    "abstract": "The emergence of noisy medium-scale quantum devices has led to proof-of-concept applications for quantum computing in various domains. Examples include Natural Language Processing (NLP) where sentence classification experiments have been carried out, as well as procedural generation, where tasks such as geopolitical map creation, and image manipulation have been performed. We explore applications at the intersection of these two areas by designing a hybrid quantum-classical algorithm for sentence generation. Our algorithm is based on the well-known simulated annealing technique for combinatorial optimisation. An implementation is provided and used to demonstrate successful sentence generation on both simulated and real quantum hardware. A variant of our algorithm can also used for music generation. This paper aims to be self-contained, introducing all the necessary background on NLP and quantum computing along the way.",
    "UID": "paper26",
    "start_time": "2022-07-20T11:30:00Z",
    "paper": "https://openreview.net/attachment?id=oud0NFEGxbo&name=paper",
    "summary_video": "https://openreview.net/attachment?id=oud0NFEGxbo&name=video_preview",
    "summary_video_captions": "https://openreview.net/attachment?id=oud0NFEGxbo&name=video_preview_captions",
    "full_video": "https://openreview.net/attachment?id=oud0NFEGxbo&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=oud0NFEGxbo&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=oud0NFEGxbo&name=slides"
  },
  "paper27": {
    "authors": [
      "Bhavya Bhavya",
      "Jinjun Xiong",
      "ChengXiang Zhai"
      ],
    "title": "Analogy Generation by Prompting Large Language Models: A Case Study of InstructGPT",
    "session": "Oral Session 3",
    "abstract": "We propose a novel application of prompting Pre-trained Language Models (PLMs) to generate analogies and study how to design effective prompts for two task settings: generating a source concept analogous to a given target concept (aka Analogous Concept Generation ACG), and generating an explanation of the similarity between a given pair of target concept and source concept (aka Analogous Concept Explanation or ACE). We found that it is feasible to prompt InstructGPT to generate meaningful analogies and the best prompts tend to be precise imperative statements especially with low temperature setting. We also systematically analyzed the sensitivity of the InstructGPT model to prompt design and temperature and found that the model is particularly sensitive to certain variations (e.g., questions vs. imperative statements). Further, we conducted human evaluation on 1.3k of the generated analogies and found that the quality of generations varies substantially by model size. The largest InstructGPT model can achieve human-level performance at generating meaningful analogies for a given target while there is still room for improvement on the ACE task.",
    "UID": "paper27",
    "start_time": "2022-07-21T14:40:00Z",
    "paper": "https://openreview.net/forum?id=uBiMMgT3E77",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=S0E9Uaa86np&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=S0E9Uaa86np&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=S0E9Uaa86np&name=slides"
  },
  "paper28": {
    "authors": [
      "Khyati Mahajan",
      "Sashank Santhanam",
      "Samira Shaikh"
      ],
    "title": "Towards Evaluation of Multi-party Dialogue Systems",
    "session": "Oral Session 1",
    "abstract": "Recent research in the field of conversational AI has emphasized the need for standardization of the metrics used in evaluation. In this work, we focus on evaluation methods used for multi-party dialogue systems. We present an expanded taxonomy focusing on multi-party dialogue based on the need for evaluation dimensions that address challenges associated with the presence of multiple participants. We also survey the evaluation metrics utilized in current multi-party dialogue research, and present our findings with regards to inconsistencies within existing work. Furthermore, we discuss the subsequent need to have more consistent evaluation methodologies and benchmarks. We motivate how consistency will contribute towards a better understanding of progress in the field of multi-party dialogue systems.",
    "UID": "paper28",
    "start_time": "2022-07-19T14:50:00Z",
    "paper": "https://openreview.net/attachment?id=HS1Q9wdoIX4&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=HS1Q9wdoIX4&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=HS1Q9wdoIX4&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=HS1Q9wdoIX4&name=slides"
  },
  "paper29": {
    "authors": [
      "Amit Kumar Chaudhary",
      "Alex J. Lucassen",
      "Ioanna Tsani",
      "Alberto Testoni"
      ],
    "title": "Are Current Decoding Strategies Capable of Facing the Challenges of Visual Dialogue?",
    "session": "Poster Session 1",
    "abstract": "Decoding strategies play a crucial role in natural language generation systems. They are usually designed and evaluated in open-ended text-only tasks, and it is not clear how different strategies handle the numerous challenges that goal-oriented multimodal systems face (such as grounding and informativeness). To answer this question, we compare a wide variety of different decoding strategies and hyper-parameter configurations in a Visual Dialogue referential game. Although none of them successfully balance lexical richness, accuracy in the task, and visual grounding, our in-depth analysis allows us to highlight the strengths and weaknesses of each decoding strategy. We believe our findings and suggestions may serve as a starting point for designing more effective decoding algorithms that handle the challenges of Visual Dialogue tasks.",
    "UID": "paper29",
    "start_time": "2022-07-19T16:20:00Z",
    "paper": "https://openreview.net/attachment?id=R3O5khOL6du&name=paper",
    "summary_video": "https://openreview.net/attachment?id=R3O5khOL6du&name=video_preview",
    "summary_video_captions": "https://openreview.net/attachment?id=R3O5khOL6du&name=video_preview_captions",
    "full_video": "https://openreview.net/attachment?id=R3O5khOL6du&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=R3O5khOL6du&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=R3O5khOL6du&name=poster"
  },
  "paper30": {
    "authors": [
      "Tirthankar Ghosal",
      "Marie Hledíková",
      "Muskaan Singh",
      "Anna Nedoluzhko",
      "Ondrej Bojar"
      ],
    "title": "The Second Automatic Minuting (AutoMin) Challenge: Generating and Evaluating Minutes from Multi-Party Meetings",
    "session": "Genchal",
    "abstract": "We would host the AutoMin generation challenge at INLG 2023 as a follow-up of the first AutoMin shared task at Interspeech 2021. Our shared task primarily concerns the automated generation of meeting minutes from multi-party meeting transcripts. In our first venture, we observed the difficulty of the task and highlighted a number of open problems for the community to discuss, attempt, and solve. Hence, we invite the Natural Language Generation (NLG) community to take part in the second iteration of AutoMin. Like the first, the second AutoMin will feature both English and Czech meetings and the core task of summarizing the manuallyrevised transcripts into bulleted minutes. A new challenge we are introducing this year is to devise efficient metrics for evaluating the quality of minutes. We will also host an optional track to generate minutes for European parliamentary sessions. We carefully curated the datasets for the above tasks. Our ELITR Minuting Corpus has been recently accepted to LREC 2022 and publicly released.1 We are already preparing a new test set for evaluating the new shared tasks. We hope to carry forward the learning from the first AutoMin and instigate more community attention and interest in this timely yet challenging problem. INLG, the premier forum for the NLG community, would be an appropriate venue to discuss the challenges and future of Automatic Minuting. The main objective of the AutoMin GenChal at INLG 2023 would be to come up with efficient methods to automatically generate meeting minutes and design evaluation metrics to measure the quality of the minutes.",
    "UID": "paper30",
    "start_time": "2022-07-21T11:30:00Z",
    "paper": "https://openreview.net/attachment?id=QFJe_CaA5Q9&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "",
    "full_video_captions": "",
    "PDF": ""
  },
  "paper31": {
    "authors": [
      "Yulong Chen",
      "Ming Zhong",
      "Xuefeng Bai",
      "Naihao Deng",
      "Jing Li",
      "Yue Zhang"
      ],
    "title": "The Cross-lingual Conversation Summarization Challenge",
    "session": "GenChal",
    "abstract": "We propose the shared task of cross-lingual conversation summarization, ConvSumX Challenge, opening new avenues for researchers to investigate solutions that integrate conversation summarization and machine translation. This task can be particularly useful due to the emergence of online meetings and conferences. We use a new benchmark, covering 2 real-world scenarios and 3 language directions, including a low-resource language, for evaluation. We hope that ConvSumX can motivate research to go beyond English and break the barrier for non-English speakers to benefit from recent advances of conversation summarization.",
    "UID": "paper31",
    "start_time": "2022-07-21T11:45:00Z",
    "paper": "https://openreview.net/attachment?id=5eU7LXu-hY0&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=5eU7LXu-hY0&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=5eU7LXu-hY0&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=5eU7LXu-hY0&name=slides"
  },
  "paper32": {
    "authors": [
      "Vivek Srivastava",
      "Mayank Singh"
      ],
    "title": "HinglishEval Generation Challenge on Quality Estimation of Synthetic Code-mixed Text: Overview and Results",
    "session": "Genchal",
    "abstract": "We hosted a shared task to investigate the factors influencing the quality of the codemixed text generation systems. The teams experimented with two systems that generate synthetic code-mixed Hinglish sentences. They also experimented with human ratings that evaluate the generation quality of the two systems. The first-of-its-kind, proposed subtasks, (i) quality rating prediction and (ii) annotators’ disagreement prediction of the synthetic Hinglish dataset made the shared task quite popular among the multilingual research community. A total of 46 participants comprising 23 teams from 18 institutions registered for this shared task. The detailed description of the task and the leaderboard is available at https://codalab.lisn. upsaclay.fr/competitions/1688.",
    "UID": "paper32",
    "start_time": "2022-07-21T10:50:00Z",
    "paper": "https://openreview.net/attachment?id=bLbBeLDFfWy&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=bLbBeLDFfWy&name=presentation_video"
,    "full_video_captions": "https://openreview.net/attachment?id=bLbBeLDFfWy&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=bLbBeLDFfWy&name=slides"
  },
  "paper33": {
    "authors": [
      "Prashant Kodali",
      "Tanmay Sachan",
      "Akshay Goindani",
      "Anmol Goel",
      "Naman Ahuja",
      "Manish Shrivastava",
      "Ponnurangam Kumaraguru"
      ],
    "title": "PreCogIIITH at HinglishEval: Leveraging Code-Mixing Metrics & Language Model Embeddings To Estimate Code-Mix Quality",
    "session": "GenChal",
    "abstract": "Code-Mixing is a phenomenon of mixing two or more languages in a speech event and is prevalent in multilingual societies. Given the low-resource nature of Code-Mixing, machine generation of code-mixed text is a prevalent approach for data augmentation. However, evaluating the quality of such machine generated code-mixed text is an open problem. In our submission to HinglishEval, a sharedtask collocated with INLG2022, we attempt to build models factors that impact the quality of synthetically generated code-mix text by predicting ratings for code-mix quality. HinglishEval Shared Task consists of two sub-tasks - a) Quality rating prediction); b) Disagreement prediction. We leverage popular codemixed metrics and embeddings of multilingual large language models (MLLMs) as features, and train task specific MLP regression models. Our approach could not beat the baseline results. However, for Subtask-A our team ranked a close second on F-1 and Cohen’s Kappa Score measures and first for Mean Squared Error measure. For Subtask-B our approach ranked third for F1 score, and first for Mean Squared Error measure.",
    "UID": "paper33",
    "start_time": "",
    "paper": "https://openreview.net/attachment?id=UsRH5rYx1SX&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "",
    "full_video_captions": "",
    "PDF": ""
  },
  "paper34": {
    "authors": ["Nikhil Singh"],
    "title": "Niksss at HinglishEval: Language-agnostic BERT-based Contextual Embeddings with Catboost for Quality Evaluation of the Low-Resource Synthetically Generated Code-Mixed Hinglish Text",
    "session": "GenChal",
    "abstract": "This paper describes the system description for the HinglishEval challenge at INLG 2022. The goal of this task was to investigate the factors influencing the quality of the codemixed text generation system. The task was divided into two subtasks, quality rating prediction and annotators’ disagreement prediction of the synthetic Hinglish dataset. We attempted to solve these tasks using sentencelevel embeddings, which are obtained from mean pooling the contextualized word embeddings for all input tokens in our text. We experimented with various classifiers on top of the embeddings produced for respective tasks. Our best-performing system ranked 1st on subtask B and 3rd on subtask A. We make our code available here: https://github. com/nikhilbyte/Hinglish-qEval.",
    "UID": "paper34",
    "start_time": "",
    "paper": "https://openreview.net/attachment?id=Rlxlf0a_8eK&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "",
    "full_video_captions": "",
    "PDF": ""
  },
  "paper35": {
    "authors": [
      "Shaz Furniturewala",
      "Vijay Kumari",
      "Amulya Ratna Dash",
      "Hriday Kedia",
      "Naman Ahuja",
      "Yashvardhan Sharma"
      ],
    "title": "BITS Pilani at HinglishEval: Quality Evaluation for Code-Mixed Hinglish Text Using Transformers",
    "session": "GenChal",
    "abstract": "Code-Mixed text data consists of sentences having words or phrases from more than one language. Most multi-lingual communities worldwide communicate using multiple languages, with English usually one of them. Hinglish is a Code-Mixed text composed of Hindi and English but written in Roman script. This paper aims to determine the factors influencing the quality of Code-Mixed text data generated by the system. For the HinglishEval task, the proposed model uses multilingual BERT to find the similarity between synthetically generated and human-generated sentences to predict the quality of synthetically generated Hinglish sentences.",
    "UID": "paper35",
    "start_time": "2022-07-21T10:50:00Z",
    "paper": "https://openreview.net/attachment?id=5OnApqNwVW&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=5OnApqNwVW&name=presentation_video",
    "full_video_captions": "https://openreview.net/attachment?id=5OnApqNwVW&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=5OnApqNwVW&name=slides"
  },
  "paper36": {
    "authors": [
      "Prantik Guha",
      "Rudra Dhar",
      "Dipankar Das"
      ],
    "title": "JU_NLP at HinglishEval: Quality Evaluation of the Low-Resource Code-Mixed Hinglish Text",
    "session": "GenChal",
    "abstract": "In this paper we describe a system submitted to the INLG 2022 Generation Challenge (GenChal) on Quality Evaluation of the LowResource Synthetically Generated Code-Mixed Hinglish Text. We implement a Bi-LSTMbased neural network model to predict the Average rating score and Disagreement score of the synthetic Hinglish dataset. In our models, we used word embeddings for English and Hindi data, and one hot encodings for Hinglish data. We achieved a F1 score of 0.11, and mean squared error of 6.0 in the average rating score prediction task. In the task of Disagreement score prediction, we achieve a F1 score of 0.18, and mean squared error of 5.0.",
    "UID": "paper36",
    "start_time": "",
    "paper": "https://openreview.net/attachment?id=nZ72ulItwNn&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "",
    "full_video_captions": "",
    "PDF": ""
  },
  "paper37": {
    "authors": [
      "Anya Belz",
      "Anastasia Shimorina",
      "Maja Popovic",
      "Ehud Reiter"
      ],
    "title": "The 2022 ReproGen Shared Task on Reproducibility of Evaluations in NLG: Overview and Results",
    "session": "GenChal",
    "abstract": "Against a background of growing interest in reproducibility in NLP and ML, and as part of an ongoing research programme designed to develop theory and practice of reproducibility assessment in NLP, we organised the second shared task on reproducibility of evaluations in NLG, ReproGen 2022. This paper describes the shared task, summarises results from the reproduction studies submitted, and provides further comparative analysis of the results. Out of six initial team registrations, we received submissions from five teams. Meta-analysis of the five reproduction studies revealed varying degrees of reproducibility, and allowed further tentative conclusions about what types of evaluation tend to have better reproducibility.",
    "UID": "paper37",
    "start_time": "2022-07-21T11:10:00Z",
    "paper": "https://openreview.net/attachment?id=7h3zH7PW28&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=7h3zH7PW28&name=presentation_video",
    "full_video_captions": "",
    "PDF": "https://openreview.net/attachment?id=7h3zH7PW28&name=slides"
  },
  "paper38": {
    "authors": [
      "Rudali HUIDrom",
      "Ondrej Dusek",
      "Zdeněk Kasner",
      "Thiago Castro Ferreira",
      "Anya Belz"
      ],
    "title": "Reproductions of a Human-Assessed Comparative Evaluation of a Semantic Error Detection System",
    "session": "GenChal",
    "abstract": "",
    "UID": "paper38",
    "start_time": "",
    "paper": "",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=mf5iR1-xN7Q&name=presentation_video",
    "full_video_captions": "https://openreview.net/attachment?id=mf5iR1-xN7Q&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=mf5iR1-xN7Q&name=poster"
  },
  "paper39": {
    "authors": [
      "Mohammad Arvan",
      "Luis Pina",
      "Natalie Parde"
      ],
    "title": "Reproducibility of Exploring Neural Text Simplification Models: A Review",
    "session": "GenChal",
    "abstract": "",
    "UID": "paper39",
    "start_time": "",
    "paper": "",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=XA48unKQwW&name=presentation_video",
    "full_video_captions": "https://openreview.net/attachment?id=XA48unKQwW&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=XA48unKQwW&name=poster"
  },
  "paper40": {
    "authors": [
      "Craig Thomson",
      "Ehud Reiter"
      ],
    "title": "The Accuracy Evaluation Shared Task as a Retrospective Reproduction Study",
    "session": "GenChal",
    "abstract": "We investigate the data collected for the Accuracy Evaluation Shared Task as a retrospective reproduction study. The shared task was based upon errors found by human annotation of computer generated summaries of basketball games. Annotation was performed in three separate stages, with texts taken from the same three systems and checked for errors by the same three annotators. We show that the mean count of errors was consistent at the highest level for each experiment, with increased variance when looking at per-system and/or per-errortype breakdowns.",
    "UID": "paper40",
    "start_time": "",
    "paper": "https://openreview.net/attachment?id=xuQNPCLuvjZ&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=xuQNPCLuvjZ&name=presentation_video",
    "full_video_captions": "https://openreview.net/attachment?id=xuQNPCLuvjZ&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=xuQNPCLuvjZ&name=poster"
  },
  "paper41": {
    "authors": [
      "Maja Popovic",
      "Sheila Castilho",
      "Rudali HUIDrom",
      "Anya Belz"
      ],
    "title": "Reproducing a Manual Evaluation of Simplicity in Text Simplification System Outputs",
    "session": "GenChal",
    "abstract": "",
    "UID": "paper41",
    "start_time": "",
    "paper": "",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=_EysyNqo5X6&name=presentation_video",
    "full_video_captions": "",
    "PDF": "https://openreview.net/attachment?id=_EysyNqo5X6&name=poster"
  },
  "paper42": {
    "authors": [
      "Anouck Braggaar",
      "Frédéric Tomas",
      "Peter Blomsma",
      "Saar Hommes",
      "Nadine Braun",
      "Emiel van Miltenburg",
      "Chris Van der Lee",
      "Martijn Goudbeek",
      "Emiel Krahmer"
      ],
    "title": "A reproduction study of methods for evaluating dialogue system output: Replicating Santhanam and Shaikh (2019)",
    "session": "GenChal",
    "abstract": "In this paper, we describe our reproduction effort of the paper: Towards Best Experiment Design for Evaluating Dialogue System Output by Santhanam and Shaikh (2019) for the 2022 ReproGen shared task. We aim to produce the same results, using different human evaluators, and a different implementation of the automatic metrics used in the original paper. Although overall the study posed some challenges to reproduce (e.g. difficulties with reproduction of automatic metrics and statistics), in the end we did find that the results generally replicate the findings of Santhanam and Shaikh (2019) and seem to follow similar trends.",
    "UID": "paper42",
    "start_time": "",
    "paper": "https://openreview.net/attachment?id=9A7TOTfnS9&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=9A7TOTfnS9&name=presentation_video",
    "full_video_captions": "https://openreview.net/attachment?id=9A7TOTfnS9&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=9A7TOTfnS9&name=poster"
  },
  "paper43": {
    "authors": [
      "Naihao Deng",
      "Yulong Chen",
      "Yang Liu",
      "Yue Zhang"
      ],
    "title": "DialogSum Challenge: Results of the Dialogue Summarization Shared Task",
    "session": "GenChal",
    "abstract": "We report the results of DialogSum Challenge, the shared task on summarizing real-life scenario dialogues at INLG 2022. Four teams participate in this shared task and three submit their system reports, exploring different methods to improve the performance of dialogue summarization. Although there is a great improvement over the baseline models regarding automatic evaluation metrics, such as ROUGE scores, we find that there is a salient gap between model generated outputs and human annotated summaries by human evaluation from multiple aspects. These findings demonstrate the difficulty of dialogue summarization and suggest that more fine-grained evaluatuion metrics are in need.",
    "UID": "paper43",
    "start_time": "2022-07-21T10:30:00Z",
    "paper": "https://openreview.net/attachment?id=CUaMhP_jT4L&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=CUaMhP_jT4L&name=presentation_video",
    "full_video_captions": "https://openreview.net/attachment?id=CUaMhP_jT4L&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=CUaMhP_jT4L&name=slides"
  },
  "paper44": {
    "authors": [
      "Vipul Chauhan",
      "Prasenjeet Roy",
      "Lipika Dey",
      "Tushar Goel"
      ],
    "title": "TCS_WITM_2022 @ DialogSum: Topic oriented Summarization using Transformer based Encoder Decoder Model",
    "session": "GenChal",
    "abstract": "In this paper, we present our approach to the DialogSum challenge, which was proposed as a shared task aimed to summarize dialogues from real-life scenarios. The challenge was to design a system that can generate fluent and salient summaries of a multi-turn dialogue text. Dialogue summarization has many commercial applications as it can be used to summarize conversations between customers and service agents, meeting notes, conference proceedings etc. Appropriate dialogue summarization can enhance the experience of conversing with chatbots or personal digital assistants. We have proposed a topic-based abstractive summarization method, which is generated by fine-tuning PEGASUS1 , which is the state of the art abstractive summary generation model.We have compared different types of fine-tuning approaches that can lead to different types of summaries. We found that since conversations usually veer around a topic, using topics along with the dialoagues, helps to generate more human-like summaries. The topics in this case resemble user perspective, around which summaries are usually sought. The generated summary has been evaluated with ground truth summaries provided by the challenge owners. We use the py-rouge score and BERT-Score metrics to compare the results.",
    "UID": "paper44",
    "start_time": "",
    "paper": "https://openreview.net/attachment?id=WUaesmeiki3&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=WUaesmeiki3&name=presentation_video",
    "full_video_captions": "https://openreview.net/attachment?id=WUaesmeiki3&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=WUaesmeiki3&name=poster"
  },
  "paper45": {
    "authors": [
      "Saprativa Bhattacharjee",
      "Kartik Shinde",
      "Tirthankar Ghosal",
      "Asif Ekbal"
      ],
    "title": "A Multi-Task Learning Approach for Summarization of Dialogues",
    "session": "GenChal",
    "abstract": "We describe our multi-task learning based approach for summarization of real-life dialogues as part of the DialogSum Challenge shared task at INLG 2022. Our approach intends to improve the main task of abstractive summarization of dialogues through the auxiliary tasks of extractive summarization, novelty detection and language modeling. We conduct extensive experimentation with different combinations of tasks and compare the results. In addition, we also incorporate the topic information provided with the dataset to perform topic-aware summarization. We report the results of automatic evaluation of the generated summaries in terms of ROUGE and BERTScore.",
    "UID": "paper45",
    "start_time": "",
    "paper": "https://openreview.net/attachment?id=t1eYNeJTsAK&name=paper",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=t1eYNeJTsAK&name=presentation_video",
    "full_video_captions": "https://openreview.net/attachment?id=t1eYNeJTsAK&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=t1eYNeJTsAK&name=poster"
  },
  "paper46": {
    "authors": [
      "Conrad Lundberg",
      "Leyre Sánchez Viñuela",
      "Siena Biales"
      ],
    "title": "Dialogue Summarization using BART",
    "session": "GenChal",
    "abstract": "",
    "UID": "paper46",
    "start_time": "",
    "paper": "",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=NyAs0YiX2k&name=presentation_video",
    "full_video_captions": "https://openreview.net/attachment?id=NyAs0YiX2k&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=NyAs0YiX2k&name=poster"
  },
  "paper47": {
    "authors": [
      "Mohammad Arvan",
      "Luis Pina",
      "Natalie Parde"
      ],
    "title": "Reproducibility of Exploring Neural Text Simplification Models: A Review",
    "session": "GenChal",
    "abstract": "",
    "UID": "paper47",
    "start_time": "",
    "paper": "",
    "summary_video": "",
    "summary_video_captions": "",
    "full_video": "https://openreview.net/attachment?id=6KoS7uz6E_3&name=presentation_video",
    "full_video_captions": "https://openreview.net/attachment?id=6KoS7uz6E_3&name=presentation_video_captions",
    "PDF": "https://openreview.net/attachment?id=6KoS7uz6E_3&name=poster"
  }
}