{"calls":[{"deadline":"March 15, 2022 11:59:59 AOE","text":"We invite the submission of long and short papers, as well as system demonstrations, related to all aspects of Natural Language Generation (NLG), including data-to-text, concept-to-text, text-to-text and vision-to-text approaches. Accepted papers will be presented as oral talks or posters. The event is organised under the auspices of the Special Interest Group on Natural Language Generation (SIGGEN) (https://aclweb.org/aclwiki/SIGGEN) of the Association for Computational Linguistics (ACL) (https://aclweb.org/).\n\nImportant dates\nAll deadlines are Anywhere on Earth (UTC-12) - submission deadline: March 15, 2022\nTopics\nINLG 2022 solicits papers on any topic related to NLG. General topics of interest include, but are not limited to: - Affect/emotion generation - Analysis and detection of automatically generated text - Applications for people with disabilities - Cognitive modelling of language production - Computational Efficiency of NLG models - Content and text planning - Corpora and resources for NLG - Deep learning models for NLG - Ethical considerations of NLG - Evaluation of NLG systems - Explainability, Fairness and Trustworthy of NLG systems - Generalizability of NLG systems - Grounded language generation - Lexicalisation - Multimedia and multimodality in generation - Natural language understanding techniques for NLG - NLG and accessibility - NLG and speech synthesis - NLG in dialogue - NLG for embodied agents and robots - NLG for real-world applications - Paraphrasing, summarization and translation - Personalisation and variation in text - Referring expression generation - Storytelling and narrative generation - Surface realisation - Systems architecture\nSubmissions & Format\nThree kinds of papers can be submitted: - Long papers are most appropriate for presenting substantial research results and must not exceed eight (8) pages of content, plus unlimited pages of references. The final versions of long papers will be given one additional page of content (up to 9 pages) so that reviewers' comments can be taken into account. - Short papers are more appropriate for presenting an ongoing research effort and must not exceed four (4) pages, plus unlimited pages of references. The final versions of short papers will be given one additional page of content (up to 5 pages) so that reviewers' comments can be taken into account. - Demo papers should be no more than two (2) pages in length, including references, and should describe implemented systems which are of relevance to the NLG community. Authors of demo papers should be willing to present a demo of their system during INLG 2021.\nSubmissions of long and short papers should be made through ACL Rolling Review (https://aclrollingreview.org). Please refer to the ARR call for papers for style files (https://aclrollingreview.org/cfp/). The last ARR submission date for eligibility for INLG 2022 will be the March 15, 2022 deadline. The last date for \"committing\" papers + reviews to INLG will be May 7, 2022 11:59:59 AOE. Authors will \"commit\" papers to INLG 2022 through the INLG 2022 OpenReview site (link to come).\nSubmissions of demo papers should be made directly through the INLG 2022 OpenReview site (link to come).\nAll accepted papers will be published in the INLG 2022 proceedings and included in the ACL anthology. A paper accepted for presentation at INLG 2022 must not have been presented at any other meeting with publicly available proceedings. Dual submission to other conferences is permitted, provided that authors clearly indicate this in the submission form. If the paper is accepted at both venues, the authors will need to choose which venue to present at, since they can not present the same paper twice.","title":"Call for Papers"},{"deadline":"March 15, 2022 11:59:59 AOE","text":"A separate call for workshop proposals will be coming soon","title":"Call for Workshop Proposals"},{"deadline":"March 15, 2022 11:59:59 AOE","text":"A separate call for tutorial proposals will be coming soon","title":"Call for Tutorial Proposals"},{"deadline":"March 15, 2022 11:59:59 AOE","text":"A separate call for Generation Challenges will be coming soon","title":"Call for Generation Challenges"}]}
