{"calls":[{"body":"sitedata/cfp.md","bodytext":"We invite the submission of long and short papers, as well as system demonstrations, related to all aspects of Natural Language Generation (NLG), including data-to-text, concept-to-text, text-to-text and vision-to-text approaches. Accepted papers will be presented as oral talks or posters.\n\nThe event is organised under the auspices of the Special Interest Group on Natural Language Generation (SIGGEN) (https://aclweb.org/aclwiki/SIGGEN) of the Association for Computational Linguistics (ACL) (https://aclweb.org/).\n\n###Important dates\n\nAll deadlines are Anywhere on Earth (UTC-12)\n\n* submission deadline: March 15, 2022\n* commit to INLG deadline: May 7, 2022\n* notification: May 17, 2022\n* camera ready: June 18, 2022\n\n###Topics\n\nINLG 2022 solicits papers on any topic related to NLG. General topics of interest include, but are not limited to:\n\n* Affect/emotion generation\n* Analysis and detection of automatically generated text\n* Applications for people with disabilities\n* Cognitive modelling of language production\n* Computational Efficiency of NLG models\n* Content and text planning\n* Corpora and resources for NLG\n* Deep learning models for NLG\n* Ethical considerations of NLG\n* Evaluation of NLG systems\n* Explainability, Fairness and Trustworthy of NLG systems\n* Generalizability of NLG systems\n* Grounded language generation\n* Lexicalisation\n* Multimedia and multimodality in generation\n* Natural language understanding techniques for NLG\n* NLG and accessibility\n* NLG and speech synthesis\n* NLG in dialogue\n* NLG for embodied agents and robots\n* NLG for real-world applications\n* Paraphrasing, summarization and translation\n* Personalisation and variation in text\n* Referring expression generation\n* Storytelling and narrative generation\n* Surface realisation\n* Systems architecture\n\n###Submissions & Format\n\nThree kinds of papers can be submitted:\n\n* Long papers are most appropriate for presenting substantial research results and must not exceed eight (8) pages of content, plus unlimited pages of references. The final versions of long papers will be given one additional page of content (up to 9 pages) so that reviewers' comments can be taken into account.\n* Short papers are more appropriate for presenting an ongoing research effort and must not exceed four (4) pages, plus unlimited pages of references. The final versions of short papers will be given one additional page of content (up to 5 pages) so that reviewers' comments can be taken into account.\n* Demo papers should be no more than two (2) pages in length, including references, and should describe implemented systems which are of relevance to the NLG community. Authors of demo papers should be willing to present a demo of their system during INLG 2021.\n\nSubmissions of long and short papers should be made through [ACL Rolling Review](https://aclrollingreview.org). Please refer to the ARR [call for papers](https://aclrollingreview.org/cfp) for style files and guidelines. The last ARR submission date for eligibility for INLG 2022 will be the March 15, 2022 deadline. The last date for \\\"committing\\\" papers + reviews to INLG will be May 7, 2022 11:59:59 AOE. Authors will \\\"commit\\\" papers to INLG 2022 through the INLG 2022 OpenReview commitment site [https://openreview.net/group?id=aclweb.org/INLG/2022/Conference_Commitments](https://openreview.net/group?id=aclweb.org/INLG/2022/Conference_Commitments).\n\nSubmissions of demo papers should be made directly through the INLG 2022 OpenReview demo submissions site no later than May 7, 2022: [https://openreview.net/group?id=aclweb.org/INLG/2022/Conference](https://openreview.net/group?id=aclweb.org/INLG/2022/Conference).\n\nAll accepted papers will be published in the INLG 2022 proceedings and included in the ACL anthology. A paper accepted for presentation at INLG 2022 must not have been presented at any other meeting with publicly available proceedings. Dual submission to other conferences is permitted, provided that authors clearly indicate this in the submission form. If the paper is accepted at both venues, the authors will need to choose which venue to present at, since they can not present the same paper twice.\n\n\n### Frequently Asked Questions\n\n\nQ: What papers may be committed to INLG 2022?<br/>\nA: You may commit any paper submitted to ARR since ARR started.\n\nQ: What version of my paper should I commit to INLG 2022?<br/>\nA: You must commit the most recent version of the paper that has recevied reviews.\n\nQ: Does INLG 2022 have an anonymity policy?<br/>\nA: INLG 2022 follows the [ACL policy](https://www.aclweb.org/adminwiki/index.php?title=ACL_Policies_for_Submission,_Review_and_Citation).\n\nQ: Can I respond to the reviews when I commit to INLG 2022?<br/>\nA: INLG 2022 follows the practice adopted by ACL 2022. In the commitment form there will be space for you to provide an optional comment to the INLG 2022 area chairs. As with ACL 2022, \"These comments are mainly to raise potential concerns about objective misunderstandings by the reviewers and/or by the Action Editor about the technical aspect of the paper\". These comments will only be visible to the INLG 2022 area chairs and program chairs. They will *not* be shared with the ARR reviewers or action editor. \n\nQ: Can I revise my paper that I am committing to INLG 2022?<br/>\nA: The acceptance decisions will be made on the basis of the most recent version of your paper that was submitted to ARR and received reviews. If your paper is accepted to INLG 2022, you will have the opportunity to revise it before sending the camera-ready version.\n\n","deadline":"March 15, 2022 11:59:59 AOE","id":1,"title":"Call for Papers"},{"body":"sitedata/wcfp.md","bodytext":"We invite the submission of workshop proposals related to all aspects\nof Natural Language Generation (NLG), including\ndata-to-text, concept-to-text, text-to-text and vision-to-text\napproaches. \n\nSubmissions should describe the proposed workshop in detail, including information regarding organisers, motivating theoretical interest and/or application context, and schedule.\n\nAccepted workshops will be held on July 21 or 22, 2022, in coordination with INLG 2022.\n\n###Important dates\n\nAll deadlines are Anywhere on Earth (UTC-12)\n\n* submission deadline: February 14, 2022\n* notification deadline: February 21, 2022\n* workshop papers camera ready deadline: June 10, 2022 \n\n###Submissions and format\n\nSubmissions should be no more than 4 (four) pages long excluding citations, and should follow the [ACLPUB formatting guidelines](https://acl-org.github.io/ACLPUB/formatting.html). Anonymization is not required.\n\nSubmissions should be emailed to inlgmeeting@gmail.com.\n","deadline":"February 14, 2022 11:59:59 AOE","id":2,"title":"Call for Workshop Proposals"},{"body":"sitedata/tcfp.md","bodytext":"We invite the submission of tutorial/hackathon proposals related to all aspects\nof Natural Language Generation (NLG), including\ndata-to-text, concept-to-text, text-to-text and vision-to-text\napproaches. \n\nSubmissions should describe the proposed tutorial or hackathon in detail, including information regarding organisers, motivating theoretical interest and/or application context, and schedule.\n\nAccepted tutorials and hackathons will be held on July 21 or 22, 2022, in coordination with INLG 2022.\n\n###Important dates\n\nAll deadlines are Anywhere on Earth (UTC-12)\n\n* submission deadline: March 21, 2022\n* notification deadline: March 28, 2022\n\n###Submissions and format\n\nSubmissions should be no more than 4 (four) pages long excluding citations, and should follow the [ACLPUB formatting guidelines](https://acl-org.github.io/ACLPUB/formatting.html). Anonymization is not required.\n\nSubmissions should be emailed to inlgmeeting@gmail.com.\n\n","deadline":"March 21, 2022 11:59:59 AOE","id":3,"title":"Call for Tutorial Proposals"},{"body":"sitedata/gccfp.md","bodytext":"We invite submissions of papers describing ideas for future shared tasks in the general area of language generation (Generation Challenges 2022). Proposed tasks can be in the area of core NLG, or in other research areas in which language is generated. Examples include, but are not limited to: data-to-text NLG, text-to-text generation (including MT and summarisation), combining core NLG and MT, combining core NLG and text summarisation, NLG quality estimation, NLG evaluation metrics, and/or generating language from heterogeneous data, including image and video.\n\nThe Generation Challenges (GenChal) are an umbrella event designed to bring together a variety of shared-task efforts that involve the generation of natural language. This year, Generation Challenges will be held during a special session at the 15th International Conference on Natural Language Generation (INLG 2022), scheduled on 18-22 July 2022.\n\nThe session will follow the format of previous GenChal results sessions, with presentations of results by the organisers of the generation challenges that are currently running, as well as presentations of proposals for new shared tasks in the Task Proposals Track.\n\nSubmissions should describe possible future tasks in detail, including information regarding organisers, task description, motivating theoretical interest and/or application context, size and state of completion of data to be used, schedule and evaluation plans. Accepted shared tasks will be run in the 2023 iteration of INLG.\n\n### Important dates\n\n* Submission deadline: 27 April 2022\n* Notification: 25 May 2022\n* Camera-ready submission: 18 June 2022\nAll deadlines are 11:59pm UTC-12h (\"anywhere on Earth\")\n\n### Submissions and format\n\nSubmissions in the Task Proposals track should be no more than 4 (four) pages long excluding citations, and should follow the [ACLPUB formatting guidelines](https://acl-org.github.io/ACLPUB/formatting.html) and [template files](https://github.com/acl-org/acl-style-files/tree/master). \n\nSubmissions should be emailed to inlgmeeting@gmail.com.\n\nSubmissions will be peer-reviewed by the program committee. As reviewing will not be blind, there is no need to anonymise papers.\n\nThis is not intended to be a selective process, since the aim is to discuss new potential shared tasks with INLG delegates. However, the organisers reserve the right to reject proposals which do not fall within the scope of the GenChal initiative, or which do not follow guidelines.\n\nAccepted submissions will be included in the INLG 2022 proceedings.\n\nPrevious GenChal challenges: [https://sites.google.com/site/genchalrepository/](https://sites.google.com/site/genchalrepository/)\n\n","deadline":"April 27, 2022 11:59:59 AOE","id":4,"title":"Call for Generation Challenges"}]}
